BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446rcc.c
/******************************************************************************
	STM32 446 RCC
Author: Sergio Santos 
	<sergio.salazar.santos@gmail.com>
License: GNU General Public License
Hardware: STM32-446
Date: 19062023
Comment:
	
*******************************************************************************/
/*** File Library ***/
#include "stm32446mapping.h"
#include "stm32446rcc.h"

/*** File Variables ***/
static STM32446RCC_cr stm32446_rcc_cr;
static STM32446RCC_pllcfgr stm32446_rcc_pllcfgr;
static STM32446RCC_cfgr stm32446_rcc_cfgr;
static STM32446RCC_cir stm32446_rcc_cir;
static STM32446RCC_ahb1rstr stm32446_rcc_ahb1rstr;
static STM32446RCC_ahb2rstr stm32446_rcc_ahb2rstr;
static STM32446RCC_ahb3rstr stm32446_rcc_ahb3rstr;
static STM32446RCC_apb1rstr stm32446_rcc_apb1rstr;
static STM32446RCC_apb2rstr stm32446_rcc_apb2rstr;
static STM32446RCC_ahb1enr stm32446_rcc_ahb1enr;
static STM32446RCC_ahb2enr stm32446_rcc_ahb2enr;
static STM32446RCC_ahb3enr stm32446_rcc_ahb3enr;
static STM32446RCC_apb1enr stm32446_rcc_apb1enr;
static STM32446RCC_apb2enr stm32446_rcc_apb2enr;
static STM32446RCC_ahb1lpenr stm32446_rcc_ahb1lpenr;
static STM32446RCC_ahb2lpenr stm32446_rcc_ahb2lpenr;
static STM32446RCC_ahb3lpenr stm32446_rcc_ahb3lpenr;
static STM32446RCC_apb1lpenr stm32446_rcc_apb1lpenr;
static STM32446RCC_apb2lpenr stm32446_rcc_apb2lpenr;
static STM32446RCC_bdcr stm32446_rcc_bdcr;
static STM32446RCC_csr stm32446_rcc_csr;
static STM32446RCC_sscgr stm32446_rcc_sscgr;
static STM32446RCC_plli2scfgr stm32446_rcc_plli2scfgr;
static STM32446RCC_pllsaicfgr stm32446_rcc_pllsaicfgr;
static STM32446RCC_dckcfgr stm32446_rcc_dckcfgr;
static STM32446RCC_ckgatenr stm32446_rcc_ckgatenr;
static STM32446RCC_dckcfgr2 stm32446_rcc_dckcfgr2;
static STM32446RCCPLL stm32446_rcc_pll;
static STM32446RCCPLLI2S stm32446_rcc_plli2s;
static STM32446RCCPLLSAI stm32446_rcc_pllsai;
static STM32446RCCobj stm32446_rcc;

static uint32_t rcc_time_out;

/*** File Procedure & Function Header ***/
STM32446RCC_cr* stm32446_rcc_cr_inic(void);
STM32446RCC_pllcfgr* stm32446_rcc_pllcfgr_inic(void);
STM32446RCC_cfgr* stm32446_rcc_cfgr_inic(void);
STM32446RCC_cir* stm32446_rcc_cir_inic(void);
STM32446RCC_ahb1rstr* stm32446_rcc_ahb1rstr_inic(void);
STM32446RCC_ahb2rstr* stm32446_rcc_ahb2rstr_inic(void);
STM32446RCC_ahb3rstr* stm32446_rcc_ahb3rstr_inic(void);
STM32446RCC_apb1rstr* stm32446_rcc_apb1rstr_inic(void);
STM32446RCC_apb2rstr* stm32446_rcc_apb2rstr_inic(void);
STM32446RCC_ahb1enr* stm32446_rcc_ahb1enr_inic(void);
STM32446RCC_ahb2enr* stm32446_rcc_ahb2enr_inic(void);
STM32446RCC_ahb3enr* stm32446_rcc_ahb3enr_inic(void);
STM32446RCC_apb1enr* stm32446_rcc_apb1enr_inic(void);
STM32446RCC_apb2enr* stm32446_rcc_apb2enr_inic(void);
STM32446RCC_ahb1lpenr* stm32446_rcc_ahb1lpenr_inic(void);
STM32446RCC_ahb2lpenr* stm32446_rcc_ahb2lpenr_inic(void);
STM32446RCC_ahb3lpenr* stm32446_rcc_ahb3lpenr_inic(void);
STM32446RCC_apb1lpenr* stm32446_rcc_apb1lpenr_inic(void);
STM32446RCC_apb2lpenr* stm32446_rcc_apb2lpenr_inic(void);
STM32446RCC_bdcr* stm32446_rcc_bdcr_inic(void);
STM32446RCC_csr* stm32446_rcc_csr_inic(void);
STM32446RCC_sscgr* stm32446_rcc_sscgr_inic(void);
STM32446RCC_plli2scfgr* stm32446_rcc_plli2scfgr_inic(void);
STM32446RCC_pllsaicfgr* stm32446_rcc_pllsaicfgr_inic(void);
STM32446RCC_dckcfgr* stm32446_rcc_dckcfgr_inic(void);
STM32446RCC_ckgatenr* stm32446_rcc_ckgatenr_inic(void);
STM32446RCC_dckcfgr2* stm32446_rcc_dckcfgr2_inic(void);
/*** Extended ***/
STM32446RCCPLL* stm32446_rcc_pll_inic(void);
STM32446RCCPLLI2S* stm32446_rcc_plli2s_inic(void);
STM32446RCCPLLSAI* stm32446_rcc_pllsai_inic(void);

/*** RCC Procedure & Function Definition ***/
void STM32446RccInic(void)
{
	// Setup PLL
	// PLLDIVISION parameters
	// source 0 or 1		M 2 to 63		N 50 to 432		P 2,4,6,8
	// Q 2 to 15			R 2 to 7        (2Mhz ideal, N/m  *  clkx)

	STM32446PLLDivision(0, 8, 336, 2, 14, 7); // 0,8,360,4,15,6; 0,8,336,2,14,7;
	// Enable PLL
	// STM32446RccPLLCLKEnable(); // Only enable when Division is configured correctly.

	// SysClock prescaler parameters
	// AHB 1,2,4,8,16,64,128,256,512 		APB1 1,2,4,8,16		APB2 1,2,4,8,16
	// RTC 2 to 31

	// STM32446Prescaler(8, 1, 1, 0);
	// STM32446Prescaler(2, 1, 1, 0);
	STM32446Prescaler(1, 1, 1, 0);
	// System Clock Source
	STM32446RccHEnable(0);
	// System Clock Select or Enable
	STM32446RccHSelect(0); // SW[1:0]: System clock switch 00 - HSI, 01 - HSE pg133
	// Low Speed Internal Clock turned on as default
	// Internal low-speed oscillator enable and Internal low-speed oscillator ready
	STM32446RccLEnable(2);
	// Low speed oscillator select
	STM32446RccLSelect(2);
}
// RCC
void STM32446RccHEnable(uint8_t hclock)
{
	uint8_t set;
	uint8_t rdy;
	for( set = 1, rdy = 1; rdy ; ){
		if(hclock == 0){ // HSION: Internal high-speed clock enable
			if( set ){ RCC->CR |= ( 1 << 0); set = 0; }else if( RCC->CR & ( 1 << 1) ) rdy = 0;
		}
		else if(hclock == 1){ // HSEON: HSE clock enable
			if( set ){ RCC->CR |= ( 1 << 16); set = 0; }else if( RCC->CR & ( 1 << 17) ) rdy = 0;
		}
		else if(hclock == 2){ // HSEBYP: HSE clock bypass
			if( set ) RCC->CR |= ( 1 << 18 );
			hclock = 1;
		}
		else hclock = 0; // default
	}
}
uint8_t STM32446RccHSelect(uint8_t hclock)
{ // SW[1:0]: System clock switch 00 - HSI, 01 - HSE pg133
	RCC->CFGR &= (unsigned int) ~(3); // 00: HSI oscillator selected as system clock
	switch(hclock){
		case 1:
			RCC->CFGR |= 1; // HSE oscillator selected as system clock
		break;
		case 2:
			RCC->CFGR |= 2; // PLL_P selected as system clock
		break;
		case 3:
			RCC->CFGR |= 3; // PLL_R selected as system clock
		break;
		default:
		break;
	}
	return (RCC->CFGR >> 2) & 3;
}
void STM32446RccLEnable(uint8_t lclock)
{
	uint8_t set;
	uint8_t rdy;
	for( set = 1, rdy = 1; rdy ; ){
		if(lclock == 2){ // LSION: Internal low-speed oscillator enable
			if( set ){ RCC->CSR |= ( 1 << 0); set = 0; }else if( RCC->CSR & ( 1 << 1) ) rdy = 0;
		}
		else if(lclock == 1){ // LSEON: External low-speed oscillator enable
			if( set ){ RCC->BDCR |= ( 1 << 0); set = 0; }else if( RCC->BDCR & ( 1 << 1) ) rdy = 0;
		}
		else if(lclock == 4){ // LSEBYP: External low-speed oscillator bypass
			if( set ) RCC->BDCR |= ( 1 << 2 );
			lclock = 1;
		}
		else lclock = 2; // default
	}
}
void STM32446RccLSelect(uint8_t lclock)
{
	RCC->BDCR &= (uint32_t) ~((1 << 9) | (1 << 8)); // RTCSEL[1:0]: RTC clock source selection
	switch(lclock){
		case 2:
			RCC->BDCR |= (1 << 9); // LSI oscillator clock used as the RTC clock
		break;
		case 1:
			RCC->BDCR |= (1 << 8); // LSE oscillator clock used as the RTC clock
		break;
		case 3:
			RCC->BDCR |= ((1 << 8) | (1 << 9)); // HSE oscillator clock divided by a programmable prescaler
		break;
		default:
			RCC->BDCR |= (1 << 8); // LSE oscillator clock used as the RTC clock
		break;
	}
}
void STM32446Prescaler(uint16_t ahbpre, uint8_t ppre1, uint8_t ppre2, uint8_t rtcpre)
{
	const unsigned int mask = 0x001FFCF0;
	RCC->CFGR &= (unsigned int) ~mask; // clear args
	if(rtcpre > 1 && rtcpre < 32) // 16
		RCC->CFGR |= (rtcpre << 16);
	switch(ppre2){ // 13
		case 2:
			RCC->CFGR |= (4 << 13);
		break;
		case 4:
			RCC->CFGR |= (5 << 13);
		break;
		case 8:
			RCC->CFGR |= (6 << 13);
		break;
		case 16:
			RCC->CFGR |= (7 << 13);
		break;
		default:
		break;
	}
	switch(ppre1){ // 10
		case 2:
			RCC->CFGR |= (4 << 10);
		break;
		case 4:
			RCC->CFGR |= (5 << 10);
		break;
		case 8:
			RCC->CFGR |= (6 << 10);
		break;
		case 16:
			RCC->CFGR |= (7 << 10);
		break;
		default:
		break;
	}
	switch(ahbpre){ // 4
		case 2:
			RCC->CFGR |= (8 << 4);
		break;
		case 4:
			RCC->CFGR |= (9 << 4);
		break;
		case 8:
			RCC->CFGR |= (10 << 4);
		break;
		case 16:
			RCC->CFGR |= (11 << 4);
		break;
		case 64:
			RCC->CFGR |= (12 << 4);
		break;
		case 128:
			RCC->CFGR |= (13 << 4);
		break;
		case 256:
			RCC->CFGR |= (14 << 4);
			break;
		case 512:
			RCC->CFGR |= (15 << 4);
			break;
		default:
		break;
	}
}
// PLL
void STM32446PLLDivision(uint8_t pllsrc, uint8_t pllm, uint16_t plln, uint8_t pllp, uint8_t pllq, uint8_t pllr)
{
	const unsigned int mask = 0x7F437FFF;
	RCC->PLLCFGR &= (unsigned int) ~mask; // clear args

	if(pllr > 1 && pllr < 8){ // PLLR[28]: Main PLL division factor for I2Ss, SAIs, SYSTEM and SPDIF-Rx clocks
		RCC->PLLCFGR |= (pllr << 28);
	}

