BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446rcc.c
void STM32446RCC_PLLI2SCFGR_plli2sp(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 2, 16, value);
}
void STM32446RCC_PLLI2SCFGR_plli2sn(uint16_t value)
{
	setreg(&RCC->PLLI2SCFGR, 9, 6, value);
}
void STM32446RCC_PLLI2SCFGR_plli2sm(uint8_t value)
{
	setreg(&RCC->PLLI2SCFGR, 6, 0, value);
}
// PLLSAICFGR
void STM32446RCC_PLLSAICFGR_pllsaiq(uint8_t value)
{
	setreg(&RCC->PLLSAICFGR, 4, 24, value);
}
void STM32446RCC_PLLSAICFGR_pllsaip(uint8_t value)
{
	setreg(&RCC->PLLSAICFGR, 2, 16, value);
}
void STM32446RCC_PLLSAICFGR_pllsain(uint16_t value)
{
	setreg(&RCC->PLLSAICFGR, 9, 6, value);
}
void STM32446RCC_PLLSAICFGR_pllsaim(uint8_t value)
{
	setreg(&RCC->PLLSAICFGR, 6, 0, value);
}
// DCKCFGR
void STM32446RCC_DCKCFGR_i2s2src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 27, value);
}
void STM32446RCC_DCKCFGR_i2s1src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 25, value);
}
void STM32446RCC_DCKCFGR_timpre(uint8_t bool)
{
	setreg(&RCC->DCKCFGR, 1, 24, bool);
}
void STM32446RCC_DCKCFGR_sai2src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 22, value);
}
void STM32446RCC_DCKCFGR_sai1src(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 2, 20, value);
}
void STM32446RCC_DCKCFGR_pllsaidivq(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 5, 8, value);
}
void STM32446RCC_DCKCFGR_plli2sdivq(uint8_t value)
{
	setreg(&RCC->DCKCFGR, 5, 0, value);
}
// CKGATENR
void STM32446RCC_CKGATENR_rcc_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 6, bool);
}
void STM32446RCC_CKGATENR_flitf_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 5, bool);
}
void STM32446RCC_CKGATENR_sram_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 4, bool);
}
void STM32446RCC_CKGATENR_spare_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 3, bool);
}
void STM32446RCC_CKGATENR_cm4dbg_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 2, bool);
}
void STM32446RCC_CKGATENR_ahb2apb2_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 1, bool);
}
void STM32446RCC_CKGATENR_ahb2apb1_cken(uint8_t bool)
{
	setreg(&RCC->CKGATENR, 1, 0, bool);
}
// DCKCFGR2
void STM32446RCC_DCKCFGR2_spdifrxsel(uint8_t bool)
{
	setreg(&RCC->DCKCFGR2, 1, 29, bool);
}
void STM32446RCC_DCKCFGR2_sdiosel(uint8_t bool)
{
	setreg(&RCC->DCKCFGR2, 1, 28, bool);
}
void STM32446RCC_DCKCFGR2_ck48msel(uint8_t bool)
{
	setreg(&RCC->DCKCFGR2, 1, 27, bool);
}
void STM32446RCC_DCKCFGR2_cecsel(uint8_t bool)
{
	setreg(&RCC->DCKCFGR2, 1, 26, bool);
}
void STM32446RCC_DCKCFGR2_fmpi2c1sel(uint8_t value)
{
	setreg(&RCC->DCKCFGR2, 2, 22, value);
}
/*** Other ***/
void STM32446RCC_nvic(uint8_t bool)
{
	if(bool){ setbit(NVIC->ISER, 1, 5, 1); } else{ setbit(NVIC->ICER, 1, 5, 1); }
}
/*** Auxiliar ***/
STM32446RCC_cr* stm32446_rcc_cr_inic(void)
{

	// CR
	stm32446_rcc_cr.get_pllsairdy = STM32446RCC_CR_get_pllsairdy;
	stm32446_rcc_cr.pllsaion = STM32446RCC_CR_pllsaion;
	stm32446_rcc_cr.get_plli2srdy = STM32446RCC_CR_get_plli2srdy;
	stm32446_rcc_cr.plli2son = STM32446RCC_CR_plli2son;
	stm32446_rcc_cr.get_pllrdy = STM32446RCC_CR_get_pllrdy;
	stm32446_rcc_cr.pllon = STM32446RCC_CR_pllon;
	stm32446_rcc_cr.csson = STM32446RCC_CR_csson;
	stm32446_rcc_cr.hsebyp = STM32446RCC_CR_hsebyp;
	stm32446_rcc_cr.get_hserdy = STM32446RCC_CR_get_hserdy;
	stm32446_rcc_cr.hseon = STM32446RCC_CR_hseon;
	stm32446_rcc_cr.get_hsical = STM32446RCC_CR_get_hsical;
	stm32446_rcc_cr.hsitrim = STM32446RCC_CR_hsitrim;
	stm32446_rcc_cr.get_hsirdy = STM32446RCC_CR_get_hsirdy;
	stm32446_rcc_cr.hsion = STM32446RCC_CR_hsion;
	return &stm32446_rcc_cr;
}
STM32446RCC_pllcfgr* stm32446_rcc_pllcfgr_inic(void)
{

	// PLLCFGR
	stm32446_rcc_pllcfgr.pllr = STM32446RCC_PLLCFGR_pllr;
	stm32446_rcc_pllcfgr.pllq = STM32446RCC_PLLCFGR_pllq;
	stm32446_rcc_pllcfgr.pllsrc = STM32446RCC_PLLCFGR_pllsrc;
	stm32446_rcc_pllcfgr.pllp = STM32446RCC_PLLCFGR_pllp;
	stm32446_rcc_pllcfgr.plln = STM32446RCC_PLLCFGR_plln;
	stm32446_rcc_pllcfgr.pllm = STM32446RCC_PLLCFGR_pllm;
	return &stm32446_rcc_pllcfgr;
}
STM32446RCC_cfgr* stm32446_rcc_cfgr_inic(void)
{

	// CFGR
	stm32446_rcc_cfgr.mco2 = STM32446RCC_CFGR_mco2;
	stm32446_rcc_cfgr.mco2pre = STM32446RCC_CFGR_mco2pre;
	stm32446_rcc_cfgr.mco1pre = STM32446RCC_CFGR_mco1pre;
	stm32446_rcc_cfgr.mco1 = STM32446RCC_CFGR_mco1;
	stm32446_rcc_cfgr.rtcpre = STM32446RCC_CFGR_rtcpre;
	stm32446_rcc_cfgr.ppre2 = STM32446RCC_CFGR_ppre2;
	stm32446_rcc_cfgr.ppre1 = STM32446RCC_CFGR_ppre1;
	stm32446_rcc_cfgr.hpre = STM32446RCC_CFGR_hpre;
	stm32446_rcc_cfgr.get_sws = STM32446RCC_CFGR_get_sws;
	stm32446_rcc_cfgr.sw = STM32446RCC_CFGR_sw;
	return &stm32446_rcc_cfgr;
}
STM32446RCC_cir* stm32446_rcc_cir_inic(void)
{

	// CIR
	stm32446_rcc_cir.clear_cssc = STM32446RCC_CIR_clear_cssc;
	stm32446_rcc_cir.clear_pllsairdyc = STM32446RCC_CIR_clear_pllsairdyc;
	stm32446_rcc_cir.clear_plli2srdyc = STM32446RCC_CIR_clear_plli2srdyc;
	stm32446_rcc_cir.clear_pllrdyc = STM32446RCC_CIR_clear_pllrdyc;
	stm32446_rcc_cir.clear_hserdyc = STM32446RCC_CIR_clear_hserdyc;
	stm32446_rcc_cir.clear_hsirdyc = STM32446RCC_CIR_clear_hsirdyc;
	stm32446_rcc_cir.clear_lserdyc = STM32446RCC_CIR_clear_lserdyc;
	stm32446_rcc_cir.clear_lsirdyc = STM32446RCC_CIR_clear_lsirdyc;
	stm32446_rcc_cir.pllsairdyie = STM32446RCC_CIR_pllsairdyie;
	stm32446_rcc_cir.plli2srdyie = STM32446RCC_CIR_plli2srdyie;
	stm32446_rcc_cir.pllrdyie = STM32446RCC_CIR_pllrdyie;
	stm32446_rcc_cir.hserdyie = STM32446RCC_CIR_hserdyie;
	stm32446_rcc_cir.hsirdyie = STM32446RCC_CIR_hsirdyie;
	stm32446_rcc_cir.lserdyie = STM32446RCC_CIR_lserdyie;
	stm32446_rcc_cir.lsirdyie = STM32446RCC_CIR_lsirdyie;
	stm32446_rcc_cir.get_cssf = STM32446RCC_CIR_get_cssf;
	stm32446_rcc_cir.get_pllsairdyf = STM32446RCC_CIR_get_pllsairdyf;
	stm32446_rcc_cir.get_plli2srdyf = STM32446RCC_CIR_get_plli2srdyf;
	stm32446_rcc_cir.get_pllrdyf = STM32446RCC_CIR_get_pllrdyf;
	stm32446_rcc_cir.get_hserdyf = STM32446RCC_CIR_get_hserdyf;
	stm32446_rcc_cir.get_hsirdyf = STM32446RCC_CIR_get_hsirdyf;
	stm32446_rcc_cir.get_lserdyf = STM32446RCC_CIR_get_lserdyf;
	stm32446_rcc_cir.get_lsirdyf = STM32446RCC_CIR_get_lsirdyf;
	return &stm32446_rcc_cir;
}
STM32446RCC_ahb1rstr* stm32446_rcc_ahb1rstr_inic(void)
{

	// AHB1RSTR
	stm32446_rcc_ahb1rstr.otghsrst = STM32446RCC_AHB1RSTR_otghsrst;
	stm32446_rcc_ahb1rstr.dma2rst = STM32446RCC_AHB1RSTR_dma2rst;
	stm32446_rcc_ahb1rstr.dma1rst = STM32446RCC_AHB1RSTR_dma1rst;
	stm32446_rcc_ahb1rstr.crcrst = STM32446RCC_AHB1RSTR_crcrst;
	stm32446_rcc_ahb1rstr.gpiohrst = STM32446RCC_AHB1RSTR_gpiohrst;
	stm32446_rcc_ahb1rstr.gpiogrst = STM32446RCC_AHB1RSTR_gpiogrst;
	stm32446_rcc_ahb1rstr.gpiofrst = STM32446RCC_AHB1RSTR_gpiofrst;
	stm32446_rcc_ahb1rstr.gpioerst = STM32446RCC_AHB1RSTR_gpioerst;
	stm32446_rcc_ahb1rstr.gpiodrst = STM32446RCC_AHB1RSTR_gpiodrst;
	stm32446_rcc_ahb1rstr.gpiocrst = STM32446RCC_AHB1RSTR_gpiocrst;
	stm32446_rcc_ahb1rstr.gpiobrst = STM32446RCC_AHB1RSTR_gpiobrst;
	stm32446_rcc_ahb1rstr.gpioarst = STM32446RCC_AHB1RSTR_gpioarst;
	return &stm32446_rcc_ahb1rstr;
}
STM32446RCC_ahb2rstr* stm32446_rcc_ahb2rstr_inic(void)
{

	// AHB2RSTR
	stm32446_rcc_ahb2rstr.otgfsrst = STM32446RCC_AHB2RSTR_otgfsrst;
	stm32446_rcc_ahb2rstr.dcmirst = STM32446RCC_AHB2RSTR_dcmirst;
	return &stm32446_rcc_ahb2rstr;
}
STM32446RCC_ahb3rstr* stm32446_rcc_ahb3rstr_inic(void)
{

	// AHB3RSTR
	stm32446_rcc_ahb3rstr.qspirst = STM32446RCC_AHB3RSTR_qspirst;
	stm32446_rcc_ahb3rstr.fmcrst = STM32446RCC_AHB3RSTR_fmcrst;
	return &stm32446_rcc_ahb3rstr;
}
STM32446RCC_apb1rstr* stm32446_rcc_apb1rstr_inic(void)
{

	// APB1RSTR
	stm32446_rcc_apb1rstr.dacrst = STM32446RCC_APB1RSTR_dacrst;
	stm32446_rcc_apb1rstr.pwrrst = STM32446RCC_APB1RSTR_pwrrst;
	stm32446_rcc_apb1rstr.cecrst = STM32446RCC_APB1RSTR_cecrst;
	stm32446_rcc_apb1rstr.can2rst = STM32446RCC_APB1RSTR_can2rst;
	stm32446_rcc_apb1rstr.can1rst = STM32446RCC_APB1RSTR_can1rst;
	stm32446_rcc_apb1rstr.fmpi2c1rst = STM32446RCC_APB1RSTR_fmpi2c1rst;
	stm32446_rcc_apb1rstr.i2c3rst = STM32446RCC_APB1RSTR_i2c3rst;
	stm32446_rcc_apb1rstr.i2c2rst = STM32446RCC_APB1RSTR_i2c2rst;
	stm32446_rcc_apb1rstr.i2c1rst = STM32446RCC_APB1RSTR_i2c1rst;
	stm32446_rcc_apb1rstr.uart5rst = STM32446RCC_APB1RSTR_uart5rst;
	stm32446_rcc_apb1rstr.uart4rst = STM32446RCC_APB1RSTR_uart4rst;
	stm32446_rcc_apb1rstr.usart3rst = STM32446RCC_APB1RSTR_usart3rst;
	stm32446_rcc_apb1rstr.usart2rst = STM32446RCC_APB1RSTR_usart2rst;
	stm32446_rcc_apb1rstr.spdifrxrst = STM32446RCC_APB1RSTR_spdifrxrst;
	stm32446_rcc_apb1rstr.spi3rst = STM32446RCC_APB1RSTR_spi3rst;
	stm32446_rcc_apb1rstr.spi2rst = STM32446RCC_APB1RSTR_spi2rst;
	stm32446_rcc_apb1rstr.wwdgrst = STM32446RCC_APB1RSTR_wwdgrst;
	stm32446_rcc_apb1rstr.tim14rst = STM32446RCC_APB1RSTR_tim14rst;
	stm32446_rcc_apb1rstr.tim13rst = STM32446RCC_APB1RSTR_tim13rst;
	stm32446_rcc_apb1rstr.tim12rst = STM32446RCC_APB1RSTR_tim12rst;
	stm32446_rcc_apb1rstr.tim7rst = STM32446RCC_APB1RSTR_tim7rst;
	stm32446_rcc_apb1rstr.tim6rst = STM32446RCC_APB1RSTR_tim6rst;
	stm32446_rcc_apb1rstr.tim5rst = STM32446RCC_APB1RSTR_tim5rst;
	stm32446_rcc_apb1rstr.tim4rst = STM32446RCC_APB1RSTR_tim4rst;
	stm32446_rcc_apb1rstr.tim3rst = STM32446RCC_APB1RSTR_tim3rst;
	stm32446_rcc_apb1rstr.tim2rst = STM32446RCC_APB1RSTR_tim2rst;
	return &stm32446_rcc_apb1rstr;
}
STM32446RCC_apb2rstr* stm32446_rcc_apb2rstr_inic(void)
{

	// APB2RSTR
	stm32446_rcc_apb2rstr.sai2rst = STM32446RCC_APB2RSTR_sai2rst;
	stm32446_rcc_apb2rstr.sai1rst = STM32446RCC_APB2RSTR_sai1rst;
	stm32446_rcc_apb2rstr.tim11rst = STM32446RCC_APB2RSTR_tim11rst;
	stm32446_rcc_apb2rstr.tim10rst = STM32446RCC_APB2RSTR_tim10rst;
	stm32446_rcc_apb2rstr.tim9rst = STM32446RCC_APB2RSTR_tim9rst;
	stm32446_rcc_apb2rstr.syscfgrst = STM32446RCC_APB2RSTR_syscfgrst;
	stm32446_rcc_apb2rstr.spi4rst = STM32446RCC_APB2RSTR_spi4rst;
	stm32446_rcc_apb2rstr.spi1rst = STM32446RCC_APB2RSTR_spi1rst;
	stm32446_rcc_apb2rstr.sdiorst = STM32446RCC_APB2RSTR_sdiorst;
	stm32446_rcc_apb2rstr.adcrst = STM32446RCC_APB2RSTR_adcrst;
	stm32446_rcc_apb2rstr.usart6rst = STM32446RCC_APB2RSTR_usart6rst;
	stm32446_rcc_apb2rstr.usart1rst = STM32446RCC_APB2RSTR_usart1rst;
	stm32446_rcc_apb2rstr.tim8rst = STM32446RCC_APB2RSTR_tim8rst;
	stm32446_rcc_apb2rstr.tim1rst = STM32446RCC_APB2RSTR_tim1rst;
	return &stm32446_rcc_apb2rstr;
}
STM32446RCC_ahb1enr* stm32446_rcc_ahb1enr_inic(void)
{

	// AHB1ENR
	stm32446_rcc_ahb1enr.otghsulpien = STM32446RCC_AHB1ENR_otghsulpien;
	stm32446_rcc_ahb1enr.otghsen = STM32446RCC_AHB1ENR_otghsen;
	stm32446_rcc_ahb1enr.dma2en = STM32446RCC_AHB1ENR_dma2en;
	stm32446_rcc_ahb1enr.dma1en = STM32446RCC_AHB1ENR_dma1en;
	stm32446_rcc_ahb1enr.bkpsramen = STM32446RCC_AHB1ENR_bkpsramen;
	stm32446_rcc_ahb1enr.crcen = STM32446RCC_AHB1ENR_crcen;
	stm32446_rcc_ahb1enr.gpiohen = STM32446RCC_AHB1ENR_gpiohen;
	stm32446_rcc_ahb1enr.gpiogen = STM32446RCC_AHB1ENR_gpiogen;
	stm32446_rcc_ahb1enr.gpiofen = STM32446RCC_AHB1ENR_gpiofen;
	stm32446_rcc_ahb1enr.gpioeen = STM32446RCC_AHB1ENR_gpioeen;
	stm32446_rcc_ahb1enr.gpioden = STM32446RCC_AHB1ENR_gpioden;
	stm32446_rcc_ahb1enr.gpiocen = STM32446RCC_AHB1ENR_gpiocen;
	stm32446_rcc_ahb1enr.gpioben = STM32446RCC_AHB1ENR_gpioben;
	stm32446_rcc_ahb1enr.gpioaen = STM32446RCC_AHB1ENR_gpioaen;
	return &stm32446_rcc_ahb1enr;
}
STM32446RCC_ahb2enr* stm32446_rcc_ahb2enr_inic(void)
{

