BitNibble/Source_Library/stm32f446lib/Library/Src/stm32446rcc.c
	// BDCR
	stm32446_rcc_bdcr.bdrst = STM32446RCC_BDCR_bdrst;
	stm32446_rcc_bdcr.rtcen = STM32446RCC_BDCR_rtcen;
	stm32446_rcc_bdcr.rtcsel = STM32446RCC_BDCR_rtcsel;
	stm32446_rcc_bdcr.lsemod = STM32446RCC_BDCR_lsemod;
	stm32446_rcc_bdcr.lsebyp = STM32446RCC_BDCR_lsebyp;
	stm32446_rcc_bdcr.get_lserdy = STM32446RCC_BDCR_get_lserdy;
	stm32446_rcc_bdcr.lseon = STM32446RCC_BDCR_lseon;
	return &stm32446_rcc_bdcr;
}
STM32446RCC_csr* stm32446_rcc_csr_inic(void)
{

	// CSR
	stm32446_rcc_csr.get_lpwrrstf = STM32446RCC_CSR_get_lpwrrstf;
	stm32446_rcc_csr.get_wwdgrstf = STM32446RCC_CSR_get_wwdgrstf;
	stm32446_rcc_csr.get_iwdqrstf = STM32446RCC_CSR_get_iwdqrstf;
	stm32446_rcc_csr.get_sftrstf = STM32446RCC_CSR_get_sftrstf;
	stm32446_rcc_csr.get_porrstf = STM32446RCC_CSR_get_porrstf;
	stm32446_rcc_csr.get_pinrstf = STM32446RCC_CSR_get_pinrstf;
	stm32446_rcc_csr.get_borrstf = STM32446RCC_CSR_get_borrstf;
	stm32446_rcc_csr.clear_rmvf = STM32446RCC_CSR_clear_rmvf;
	stm32446_rcc_csr.get_lsirdy = STM32446RCC_CSR_get_lsirdy;
	stm32446_rcc_csr.lsion = STM32446RCC_CSR_lsion;
	return &stm32446_rcc_csr;
}
STM32446RCC_sscgr* stm32446_rcc_sscgr_inic(void)
{

	// SSCGR
	stm32446_rcc_sscgr.sscgen = STM32446RCC_SSCGR_sscgen;
	stm32446_rcc_sscgr.spreadsel = STM32446RCC_SSCGR_spreadsel;
	stm32446_rcc_sscgr.incstep = STM32446RCC_SSCGR_incstep;
	stm32446_rcc_sscgr.modper = STM32446RCC_SSCGR_modper;
	return &stm32446_rcc_sscgr;
}
STM32446RCC_plli2scfgr* stm32446_rcc_plli2scfgr_inic(void)
{

	// PLLI2SCFGR
	stm32446_rcc_plli2scfgr.plli2sr = STM32446RCC_PLLI2SCFGR_plli2sr;
	stm32446_rcc_plli2scfgr.plli2sq = STM32446RCC_PLLI2SCFGR_plli2sq;
	stm32446_rcc_plli2scfgr.plli2sp = STM32446RCC_PLLI2SCFGR_plli2sp;
	stm32446_rcc_plli2scfgr.plli2sn = STM32446RCC_PLLI2SCFGR_plli2sn;
	stm32446_rcc_plli2scfgr.plli2sm = STM32446RCC_PLLI2SCFGR_plli2sm;
	return &stm32446_rcc_plli2scfgr;
}
STM32446RCC_pllsaicfgr* stm32446_rcc_pllsaicfgr_inic(void)
{

	// PLLSAICFGR
	stm32446_rcc_pllsaicfgr.pllsaiq = STM32446RCC_PLLSAICFGR_pllsaiq;
	stm32446_rcc_pllsaicfgr.pllsaip = STM32446RCC_PLLSAICFGR_pllsaip;
	stm32446_rcc_pllsaicfgr.pllsain = STM32446RCC_PLLSAICFGR_pllsain;
	stm32446_rcc_pllsaicfgr.pllsaim = STM32446RCC_PLLSAICFGR_pllsaim;
	return &stm32446_rcc_pllsaicfgr;
}
STM32446RCC_dckcfgr* stm32446_rcc_dckcfgr_inic(void)
{

	// DCKCFGR
	stm32446_rcc_dckcfgr.i2s2src = STM32446RCC_DCKCFGR_i2s2src;
	stm32446_rcc_dckcfgr.i2s1src = STM32446RCC_DCKCFGR_i2s1src;
	stm32446_rcc_dckcfgr.timpre = STM32446RCC_DCKCFGR_timpre;
	stm32446_rcc_dckcfgr.sai2src = STM32446RCC_DCKCFGR_sai2src;
	stm32446_rcc_dckcfgr.sai1src = STM32446RCC_DCKCFGR_sai1src;
	stm32446_rcc_dckcfgr.pllsaidivq = STM32446RCC_DCKCFGR_pllsaidivq;
	stm32446_rcc_dckcfgr.plli2sdivq = STM32446RCC_DCKCFGR_plli2sdivq;
	return &stm32446_rcc_dckcfgr;
}
STM32446RCC_ckgatenr* stm32446_rcc_ckgatenr_inic(void)
{

	// CKGATENR
	stm32446_rcc_ckgatenr.rcc_cken = STM32446RCC_CKGATENR_rcc_cken;
	stm32446_rcc_ckgatenr.flitf_cken = STM32446RCC_CKGATENR_flitf_cken;
	stm32446_rcc_ckgatenr.sram_cken = STM32446RCC_CKGATENR_sram_cken;
	stm32446_rcc_ckgatenr.spare_cken = STM32446RCC_CKGATENR_spare_cken;
	stm32446_rcc_ckgatenr.cm4dbg_cken = STM32446RCC_CKGATENR_cm4dbg_cken;
	stm32446_rcc_ckgatenr.ahb2apb2_cken = STM32446RCC_CKGATENR_ahb2apb2_cken;
	stm32446_rcc_ckgatenr.ahb2apb1_cken = STM32446RCC_CKGATENR_ahb2apb1_cken;
	return &stm32446_rcc_ckgatenr;
}
STM32446RCC_dckcfgr2* stm32446_rcc_dckcfgr2_inic(void)
{

	// DCKCFGR2
	stm32446_rcc_dckcfgr2.spdifrxsel = STM32446RCC_DCKCFGR2_spdifrxsel;
	stm32446_rcc_dckcfgr2.sdiosel = STM32446RCC_DCKCFGR2_sdiosel;
	stm32446_rcc_dckcfgr2.ck48msel = STM32446RCC_DCKCFGR2_ck48msel;
	stm32446_rcc_dckcfgr2.cecsel = STM32446RCC_DCKCFGR2_cecsel;
	stm32446_rcc_dckcfgr2.fmpi2c1sel = STM32446RCC_DCKCFGR2_fmpi2c1sel;
	return &stm32446_rcc_dckcfgr2;
}
/*** Extended ***/
STM32446RCCPLL* stm32446_rcc_pll_inic(void)
{

	stm32446_rcc_pll.division = STM32446PLLDivision;
	stm32446_rcc_pll.enable = STM32446RccPLLCLKEnable;
	return &stm32446_rcc_pll;
}
STM32446RCCPLLI2S* stm32446_rcc_plli2s_inic(void)
{

	stm32446_rcc_plli2s.enable = STM32446RccPLLI2SEnable;
	return &stm32446_rcc_plli2s;
}
STM32446RCCPLLSAI* stm32446_rcc_pllsai_inic(void)
{

	stm32446_rcc_pllsai.enable = STM32446RccPLLSAIEnable;
	return &stm32446_rcc_pllsai;
}
/*** INIC Procedure & Function Definition ***/
STM32446RCCobj rcc_inic(void)
{

	stm32446_rcc.reg = RCC;
	/*** RCC Bit Mapping Link ***/
	stm32446_rcc.cr = stm32446_rcc_cr_inic();
	stm32446_rcc.pllcfgr = stm32446_rcc_pllcfgr_inic();
	stm32446_rcc.cfgr = stm32446_rcc_cfgr_inic();
	stm32446_rcc.cir = stm32446_rcc_cir_inic();
	stm32446_rcc.ahb1rstr = stm32446_rcc_ahb1rstr_inic();
	stm32446_rcc.ahb2rstr = stm32446_rcc_ahb2rstr_inic();
	stm32446_rcc.ahb3rstr = stm32446_rcc_ahb3rstr_inic();
	stm32446_rcc.apb1rstr = stm32446_rcc_apb1rstr_inic();
	stm32446_rcc.apb2rstr = stm32446_rcc_apb2rstr_inic();
	stm32446_rcc.ahb1enr = stm32446_rcc_ahb1enr_inic();
	stm32446_rcc.ahb2enr = stm32446_rcc_ahb2enr_inic();
	stm32446_rcc.ahb3enr = stm32446_rcc_ahb3enr_inic();
	stm32446_rcc.apb1enr = stm32446_rcc_apb1enr_inic();
	stm32446_rcc.apb2enr = stm32446_rcc_apb2enr_inic();
	stm32446_rcc.ahb1lpenr = stm32446_rcc_ahb1lpenr_inic();
	stm32446_rcc.ahb2lpenr = stm32446_rcc_ahb2lpenr_inic();
	stm32446_rcc.ahb3lpenr = stm32446_rcc_ahb3lpenr_inic();
	stm32446_rcc.apb1lpenr = stm32446_rcc_apb1lpenr_inic();
	stm32446_rcc.apb2lpenr = stm32446_rcc_apb2lpenr_inic();
	stm32446_rcc.bdcr = stm32446_rcc_bdcr_inic();
	stm32446_rcc.csr = stm32446_rcc_csr_inic();
	stm32446_rcc.sscgr = stm32446_rcc_sscgr_inic();
	stm32446_rcc.plli2scfgr = stm32446_rcc_plli2scfgr_inic();
	stm32446_rcc.pllsaicfgr = stm32446_rcc_pllsaicfgr_inic();
	stm32446_rcc.dckcfgr = stm32446_rcc_dckcfgr_inic();
	stm32446_rcc.ckgatenr = stm32446_rcc_ckgatenr_inic();
	stm32446_rcc.dckcfgr2 = stm32446_rcc_dckcfgr2_inic();
	/*** PLL ***/
	stm32446_rcc.pll = stm32446_rcc_pll_inic();
	stm32446_rcc.plli2s = stm32446_rcc_plli2s_inic();
	stm32446_rcc.pllsai = stm32446_rcc_pllsai_inic();
	stm32446_rcc.prescaler = STM32446Prescaler;
	/*** Other ***/
	stm32446_rcc.pll_division = STM32446PLLDivision;
	stm32446_rcc.pllclk_enable = STM32446RccPLLCLKEnable;
	stm32446_rcc.plli2s_enable = STM32446RccPLLI2SEnable;
	stm32446_rcc.pllsai_enable = STM32446RccPLLSAIEnable;
	stm32446_rcc.inic = STM32446RccInic;
	stm32446_rcc.henable = STM32446RccHEnable;
	stm32446_rcc.hselect = STM32446RccHSelect;
	stm32446_rcc.lenable = STM32446RccLEnable;
	stm32446_rcc.lselect = STM32446RccLSelect;
	/*** Nvic ***/
	stm32446_rcc.nvic = STM32446RCC_nvic;
	return stm32446_rcc;
}

STM32446RCCobj* rcc(void){ return &stm32446_rcc; };

/*** EOF ***/

/******
1º Sequence
2º Scope
	- Library Scope
	- File Scope
	- Function Scope
	- Precedence Scope
3º Pointer and Variable
4º Casting
******/


